In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\amrut\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: six in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlparse in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: ipython in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (8.2.0)
Requirement already satisfied: prettytable in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (3.6.0)
Requirement already satisfied: ipython-genutils in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\amrut\anaconda3\lib\site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\amrut\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\amrut\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: pickleshare in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (61.2.0)
Requirement already satisfied: pygments>=2.4.0 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: colorama in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.4)
Requirement already satisfied: matplotlib-inline in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.2)
Requirement already satisfied: stack-data in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\amrut\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\amrut\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\amrut\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.5)
Requirement already satisfied: pure-eval in c:\users\amrut\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: asttokens in c:\users\amrut\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: executing in c:\users\amrut\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)

In [2]:
%load_ext sql

In [3]:
%sql postgresql://postgres:Omsairam123%40@localhost:5432/TinyShop

### Which product has the highest price? Only return a single row.

In [18]:
%%sql



#Method 1
SELECT product_name,price 
FROM products WHERE PRICE=
(SELECT max(price) FROM products)

#Method 2
SELECT product_name,price
FROM products
ORDER BY 2 DESC
LIMIT 1

 * postgresql://postgres:***@localhost:5432/TinyShop
1 rows affected.

[('Product M', Decimal('70.00'))]

### Which customer has made the most orders?

In [33]:
%%sql

SELECT c.customer_id,count(*) num_orders
FROM customers c INNER JOIN orders o ON
c.customer_id=o.customer_id
GROUP BY c.customer_id
HAVING count(*) = (SELECT count(o.order_id)
FROM customers c INNER JOIN orders o ON
c.customer_id=o.customer_id
GROUP BY c.customer_id
ORDER BY 1 DESC
LIMIT 1
)
ORDER BY 1

 * postgresql://postgres:***@localhost:5432/TinyShop
3 rows affected.

[(1, 2), (2, 2), (3, 2)]

### Whatâ€™s the total revenue per product?

In [47]:
%%sql
SELECT p.product_id,p.product_name,sum(o.quantity)*p.price revenue
FROM products p LEFT JOIN order_items o
ON p.product_id=o.product_id
GROUP BY 1,2
ORDER BY 1

 * postgresql://postgres:***@localhost:5432/TinyShop
13 rows affected.

[(1, 'Product A', Decimal('50.00')),
 (2, 'Product B', Decimal('135.00')),
 (3, 'Product C', Decimal('160.00')),
 (4, 'Product D', Decimal('75.00')),
 (5, 'Product E', Decimal('90.00')),
 (6, 'Product F', Decimal('210.00')),
 (7, 'Product G', Decimal('120.00')),
 (8, 'Product H', Decimal('135.00')),
 (9, 'Product I', Decimal('150.00')),
 (10, 'Product J', Decimal('330.00')),
 (11, 'Product K', Decimal('180.00')),
 (12, 'Product L', Decimal('195.00')),
 (13, 'Product M', Decimal('420.00'))]

In [48]:
%%sql
SELECT p.product_id,p.product_name,sum(o.quantity*p.price) revenue
FROM products p LEFT JOIN order_items o
ON p.product_id=o.product_id
GROUP BY 1,2
ORDER BY 1

 * postgresql://postgres:***@localhost:5432/TinyShop
13 rows affected.

[(1, 'Product A', Decimal('50.00')),
 (2, 'Product B', Decimal('135.00')),
 (3, 'Product C', Decimal('160.00')),
 (4, 'Product D', Decimal('75.00')),
 (5, 'Product E', Decimal('90.00')),
 (6, 'Product F', Decimal('210.00')),
 (7, 'Product G', Decimal('120.00')),
 (8, 'Product H', Decimal('135.00')),
 (9, 'Product I', Decimal('150.00')),
 (10, 'Product J', Decimal('330.00')),
 (11, 'Product K', Decimal('180.00')),
 (12, 'Product L', Decimal('195.00')),
 (13, 'Product M', Decimal('420.00'))]

### Find the day with the highest revenue.

In [63]:
%%sql
select o.order_date,sum(oi.quantity*p.price) revenue
FROM order_items oi
INNER JOIN orders o ON
oi.order_id=o.order_id
INNER JOIN products p on 
oi.product_id=p.product_id
GROUP BY o.order_date
ORDER BY 2 DESC
LIMIT 1

 * postgresql://postgres:***@localhost:5432/TinyShop
1 rows affected.

[(datetime.date(2023, 5, 16), Decimal('340.00'))]

### Find the first order (by date) for each customer.

In [64]:
%%sql
SELECT c.customer_id,min(o.order_date) first_order_date
FROM customers c INNER JOIN orders o ON
c.customer_id=o.customer_id
GROUP BY 1
ORDER BY 1

 * postgresql://postgres:***@localhost:5432/TinyShop
13 rows affected.

[(1, datetime.date(2023, 5, 1)),
 (2, datetime.date(2023, 5, 2)),
 (3, datetime.date(2023, 5, 3)),
 (4, datetime.date(2023, 5, 7)),
 (5, datetime.date(2023, 5, 8)),
 (6, datetime.date(2023, 5, 9)),
 (7, datetime.date(2023, 5, 10)),
 (8, datetime.date(2023, 5, 11)),
 (9, datetime.date(2023, 5, 12)),
 (10, datetime.date(2023, 5, 13)),
 (11, datetime.date(2023, 5, 14)),
 (12, datetime.date(2023, 5, 15)),
 (13, datetime.date(2023, 5, 16))]

### Find the top 3 customers who have ordered the most distinct products

In [79]:
%%sql 
SELECT c.customer_id,COUNT(DISTINCT oi.product_id) num_distinct_products
FROM customers c INNER JOIN orders o ON
c.customer_id=o.customer_id
INNER JOIN order_items oi ON
oi.order_id=o.order_id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 3

 * postgresql://postgres:***@localhost:5432/TinyShop
3 rows affected.

[(2, 3), (3, 3), (1, 3)]

### Which product has been bought the least in terms of quantity?

In [99]:
%%sql

with quantity as (SELECT p.product_id,SUM(oi.quantity) prod_quant
FROM products p INNER JOIN order_items oi ON
p.product_id=oi.product_id
GROUP BY 1)
SELECT p.product_name,SUM(oi.quantity) prod_quant
FROM products p INNER JOIN order_items oi ON
p.product_id=oi.product_id
GROUP BY 1
HAVING SUM(oi.quantity)=(SELECT MIN(prod_quant) FROM quantity)

 * postgresql://postgres:***@localhost:5432/TinyShop
7 rows affected.

[('Product H', 3),
 ('Product E', 3),
 ('Product G', 3),
 ('Product L', 3),
 ('Product I', 3),
 ('Product D', 3),
 ('Product K', 3)]

### What is the median order total?

In [105]:
%%sql
WITH order_totals as(SELECT o.order_id,
                     sum(oi.quantity*p.price) total
                     FROM orders o INNER JOIN order_items oi ON
                     o.order_id=oi.order_id
                     INNER JOIN products p ON p.product_id=oi.product_id
                     GROUP BY 1
                     order by 2)
SELECT PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY total ) median FROM order_totals

 * postgresql://postgres:***@localhost:5432/TinyShop
1 rows affected.

[(112.5,)]

### For each order, determine if it was â€˜Expensiveâ€™ (total over 300), â€˜Affordableâ€™ (total over 100), or â€˜Cheapâ€™.

In [112]:
%%sql

WITH CTE as (SELECT o.order_id,SUM(oi.quantity*p.price) total
FROM orders o INNER JOIN order_items oi 
ON o.order_id=oi.order_id
INNER JOIN products p on p.product_id=oi.product_id
GROUP BY 1)
SELECT cte.order_id,cte.total, 
CASE WHEN cte.total>300 THEN 'Expensive'
     WHEN cte.total>100 AND total<=300 THEN 'Affordable'
    ELSE 'Cheap'
    END cost
FROM CTE

 * postgresql://postgres:***@localhost:5432/TinyShop
16 rows affected.

[(10, Decimal('285.00'), 'Affordable'),
 (13, Decimal('185.00'), 'Affordable'),
 (2, Decimal('75.00'), 'Cheap'),
 (12, Decimal('80.00'), 'Cheap'),
 (5, Decimal('50.00'), 'Cheap'),
 (4, Decimal('80.00'), 'Cheap'),
 (6, Decimal('55.00'), 'Cheap'),
 (11, Decimal('275.00'), 'Affordable'),
 (9, Decimal('140.00'), 'Affordable'),
 (15, Decimal('225.00'), 'Affordable'),
 (3, Decimal('50.00'), 'Cheap'),
 (8, Decimal('145.00'), 'Affordable'),
 (14, Decimal('145.00'), 'Affordable'),
 (7, Decimal('85.00'), 'Cheap'),
 (1, Decimal('35.00'), 'Cheap'),
 (16, Decimal('340.00'), 'Expensive')]

### Find customers who have ordered the product with the highest price.

In [118]:
%%sql
SELECT c.customer_id,(p.PRODUCT_NAME)
FROM customers c INNER JOIN orders o ON
c.customer_id=o.customer_id
INNER JOIN order_items oi ON
oi.order_id=o.order_id
INNER JOIN products p ON p.product_id=oi.product_id
where P.PRODUCT_NAME= (SELECT product_name
FROM products 
ORDER BY price DESC
limit 1)

 * postgresql://postgres:***@localhost:5432/TinyShop
2 rows affected.

[(8, 'Product M'), (13, 'Product M')]